index=data EventCode=3000 
| rename param1 AS "Process" param2 AS "Exit_Code" 
| stats count min(_time) as firstTime max(_time) as lastTime by Process Exit_Code dest 
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(firstTime) 
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(lastTime
